[weather]
00=晴
01=多云
02=阴
03=阵雨
04=雷阵雨
05=雷阵雨伴有冰雹
06=雨夹雪
07=小雨
08=中雨
09=大雨
10=暴雨
11=大暴雨
12=特大暴雨
13=阵雪
14=小雪
15=中雪
16=大雪
17=暴雪
18=雾
19=冻雨
20=沙尘暴
21=小到中雨
22=中到大雨
23=大到暴雨
24=暴雨到大暴雨
25=大暴雨到特大暴雨
26=小到中雪
27=中到大雪
28=大到暴雪
29=浮尘
30=扬沙
31=强沙尘暴
32=浓雾
33=雪
49=强浓雾
53=霾
54=中度霾
55=重度霾
56=严重霾
57=大雾
58=特强浓雾
301=雨
302=雪